app/views/partidas/_form.html.erb

      a = []
      Jogo.all.each do |u|
---
SELECT "jogos".* FROM "jogos"

      a = []
      User.all.each do |u|
---
SELECT "users".* FROM "users" WHERE (username = NULL)