app/views/partidas/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <tr>
        <% p1 = User.find(partida.player1_id) %>

SELECT  "jogos".* FROM "jogos" WHERE "jogos"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
        <td><%= partida.winP2 %></td>
        <td><%= Jogo.find(partida.game).nome %> </td>