app/views/partidas/show.html.erb

SELECT  "jogos".* FROM "jogos" WHERE "jogos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Jogo:</strong>
  <%= Jogo.find(@partida.game) %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Player1:</strong>
  <% p1 = User.find(@partida.player1_id) %>