app/controllers/mainpage_controller.rb

  def index
      @methods = Users.methods
      print @methods
      @users = User.all
---
SELECT "users".* FROM "users"