app/controllers/partidas_controller.rb

SELECT "partidas".* FROM "partidas"
---
    def index
        @partidas = Partida.all

SELECT "users".* FROM "users" WHERE (username = NULL)
INSERT INTO "partidas" ("winP1", "winP2", "created_at", "updated_at", "player1_id", "player2_id", "game") VALUES (?, ?, ?, ?, ?, ?, ?)  [["winP1", 3], ["winP2", 2], ["created_at", "2018-06-07 13:29:13.797317"], ["updated_at", "2018-06-07 13:29:13.797317"], ["player1_id", 1], ["player2_id", 2], ["game", 1]]
---
    def create
        p1 = current_user
        p2 = User.where("username = ?", partida_params[:player2])[0]
        winp1 = partida_params[:winP1]
        winp2 = partida_params[:winP2]
        game = partida_params[:game]
        @partida = Partida.new(player1: p1, player2: p2, winP1: winp1, winP2: winp2, game: game)
        respond_to do |format|
            if @partida.save

SELECT "users".* FROM "users" WHERE (username = NULL)
---
    def update
        puts params
        if !current_user.admin?
            redirect_to partidas_path
            return
        else
            respond_to do |format|
                p1 = current_user
                p2 = User.where("username = ?", partida_params[:player2])[0]

DELETE FROM "partidas" WHERE "partidas"."id" = ?  [["id", 980190962]]
---
    def destroy
        if !current_user.admin?
            redirect_to partidas_path
        else
            @partida.destroy

SELECT  "partidas".* FROM "partidas" WHERE "partidas"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_partida
        @partida = Partida.find(params[:id])